charakeep/app/controllers/dndclasses_controller.rb

SELECT "dndclasses".* FROM "dndclasses"
---
    def index
        dndclass = Dndclass.all

SELECT "dndclasses".* FROM "dndclasses" WHERE "dndclasses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        dndclass = Dndclass.find_by(id: params[:id])