charakeep/app/controllers/races_controller.rb

    def index
        races = Race.all
---
SELECT "races".* FROM "races"

    def show
        race = Race.find_by(id: params[:id])
---
SELECT "races".* FROM "races" WHERE "races"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]