charakeep/app/controllers/stats_controller.rb

    def index
        stats = Stat.all
---
SELECT "stats".* FROM "stats"

        def find_stat
            stat = Stat.find(params[:id])
---
SELECT "stats".* FROM "stats" WHERE "stats"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]